; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-3-16)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-4 - location
	p1-5 - location
	p2-0 - location
	p3-1 - location
	p4-3 - location
	p5-4 - location
	p5-6 - location
	p5-7 - location
	p6-2 - location
	p6-8 - location
	p7-6 - location
	p8-0 - location
	p8-3 - location
	p8-6 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s7)
	(at driver3 s0)
	(at driver4 s1)
	(at driver5 s7)
	(at driver6 s3)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at package1 s8)
	(at package2 s0)
	(at package3 s2)
	(at package4 s8)
	(at package5 s5)
	(at package6 s8)
	(at package7 s5)
	(at package8 s0)
	(at package9 s2)
	(at package10 s0)
	(at package11 s5)
	(at package12 s7)
	(at package13 s0)
	(at package14 s6)
	(at package15 s8)
	(at package16 s5)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(link s0 s3)
	(link s3 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s5)
	(link s5 s1)
	(link s1 s7)
	(link s7 s1)
	(link s1 s8)
	(link s8 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s7)
	(link s7 s2)
	(link s3 s2)
	(link s2 s3)
	(link s3 s6)
	(link s6 s3)
	(link s3 s7)
	(link s7 s3)
	(link s4 s2)
	(link s2 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s4 s6)
	(link s6 s4)
	(link s4 s7)
	(link s7 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s6)
	(link s6 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s2)
	(link s2 s6)
	(link s6 s7)
	(link s7 s6)
	(link s7 s5)
	(link s5 s7)
	(link s8 s3)
	(link s3 s8)
	(link s8 s5)
	(link s5 s8)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s4)
	(at driver4 s3)
	(at driver5 s0)
	(at driver6 s7)
	(at truck2 s0)
	(at truck3 s7)
	(at package1 s1)
	(at package2 s3)
	(at package3 s2)
	(at package4 s2)
	(at package5 s3)
	(at package6 s2)
	(at package7 s5)
	(at package8 s7)
	(at package9 s4)
	(at package10 s5)
	(at package11 s4)
	(at package12 s4)
	(at package13 s7)
	(at package14 s6)
	(at package15 s2)
	(at package16 s2)
	))


)

; plan
1. (board-truck driver4 s1 truck1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 23
2. (board-truck driver3 s0 truck3)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 23
3. (drive-truck driver4 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 3 of 23
4. (load-truck s5 package5 truck1)
   deleted: (at package5 s5)
   added: (in package5 truck1)
   goals met: 3 of 23
5. (drive-truck driver4 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 3 of 23
6. (unload-truck s3 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s3)
   goals met: 4 of 23
7. (drive-truck driver4 s3 s8 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   goals met: 4 of 23
8. (load-truck s8 package6 truck1)
   deleted: (at package6 s8)
   added: (in package6 truck1)
   goals met: 4 of 23
9. (drive-truck driver4 s8 s3 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   goals met: 4 of 23
10. (walk driver2 s7 p5-7)
   deleted: (at driver2 s7)
   added: (at driver2 p5-7)
   goals met: 4 of 23
11. (walk driver2 p5-7 s5)
   deleted: (at driver2 p5-7)
   added: (at driver2 s5)
   goals met: 4 of 23
12. (walk driver2 s5 p5-4)
   deleted: (at driver2 s5)
   added: (at driver2 p5-4)
   goals met: 4 of 23
13. (walk driver2 p5-4 s4)
   deleted: (at driver2 p5-4)
   added: (at driver2 s4)
   goals met: 5 of 23
14. (walk driver5 s7 p7-6)
   deleted: (at driver5 s7)
   added: (at driver5 p7-6)
   goals met: 5 of 23
15. (walk driver5 p7-6 s6)
   deleted: (at driver5 p7-6)
   added: (at driver5 s6)
   goals met: 5 of 23
16. (board-truck driver5 s6 truck2)
   deleted: (at driver5 s6) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 5 of 23
17. (drive-truck driver5 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 6 of 23
18. (drive-truck driver3 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 6 of 23
19. (drive-truck driver3 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 6 of 23
20. (load-truck s0 package8 truck2)
   deleted: (at package8 s0)
   added: (in package8 truck2)
   goals met: 6 of 23
21. (load-truck s0 package2 truck2)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   goals met: 6 of 23
22. (load-truck s0 package13 truck2)
   deleted: (at package13 s0)
   added: (in package13 truck2)
   goals met: 6 of 23
23. (load-truck s0 package10 truck2)
   deleted: (at package10 s0)
   added: (in package10 truck2)
   goals met: 6 of 23
24. (drive-truck driver5 s0 s7 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   goals met: 5 of 23
25. (unload-truck s7 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s7)
   goals met: 6 of 23
26. (unload-truck s7 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s7)
   goals met: 7 of 23
27. (load-truck s7 package12 truck2)
   deleted: (at package12 s7)
   added: (in package12 truck2)
   goals met: 7 of 23
28. (drive-truck driver5 s7 s0 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s0)
   goals met: 8 of 23
29. (load-truck s5 package16 truck3)
   deleted: (at package16 s5)
   added: (in package16 truck3)
   goals met: 8 of 23
30. (drive-truck driver3 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 8 of 23
31. (load-truck s2 package9 truck3)
   deleted: (at package9 s2)
   added: (in package9 truck3)
   goals met: 8 of 23
32. (drive-truck driver3 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 8 of 23
33. (unload-truck s4 package9 truck3)
   deleted: (in package9 truck3)
   added: (at package9 s4)
   goals met: 9 of 23
34. (drive-truck driver4 s3 s8 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   goals met: 9 of 23
35. (load-truck s8 package4 truck1)
   deleted: (at package4 s8)
   added: (in package4 truck1)
   goals met: 9 of 23
36. (drive-truck driver4 s8 s3 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   goals met: 9 of 23
37. (drive-truck driver3 s4 s2 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   goals met: 9 of 23
38. (unload-truck s2 package16 truck3)
   deleted: (in package16 truck3)
   added: (at package16 s2)
   goals met: 10 of 23
39. (drive-truck driver3 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 10 of 23
40. (drive-truck driver3 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 10 of 23
41. (load-truck s5 package11 truck3)
   deleted: (at package11 s5)
   added: (in package11 truck3)
   goals met: 10 of 23
42. (drive-truck driver3 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 10 of 23
43. (unload-truck s4 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s4)
   goals met: 11 of 23
44. (drive-truck driver5 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 10 of 23
45. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 10 of 23
46. (unload-truck s2 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 11 of 23
47. (unload-truck s2 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 12 of 23
48. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 12 of 23
49. (disembark-truck driver4 s3 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 13 of 23
50. (unload-truck s3 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   goals met: 14 of 23
51. (drive-truck driver5 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 15 of 23
52. (board-truck driver6 s3 truck1)
   deleted: (at driver6 s3) (empty truck1)
   added: (driving driver6 truck1)
   goals met: 15 of 23
53. (drive-truck driver6 s3 s8 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   goals met: 15 of 23
54. (load-truck s8 package15 truck1)
   deleted: (at package15 s8)
   added: (in package15 truck1)
   goals met: 15 of 23
55. (drive-truck driver6 s8 s5 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   goals met: 15 of 23
56. (drive-truck driver6 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 15 of 23
57. (unload-truck s2 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s2)
   goals met: 16 of 23
58. (drive-truck driver6 s2 s7 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   goals met: 16 of 23
59. (disembark-truck driver6 s7 truck1)
   deleted: (driving driver6 truck1)
   added: (at driver6 s7) (empty truck1)
   goals met: 17 of 23
60. (drive-truck driver5 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 16 of 23
61. (unload-truck s4 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s4)
   goals met: 17 of 23
62. (drive-truck driver5 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 18 of 23
63. (drive-truck driver5 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 17 of 23
64. (drive-truck driver5 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 17 of 23
65. (unload-truck s5 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s5)
   goals met: 18 of 23
66. (drive-truck driver5 s5 s7 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   goals met: 18 of 23
67. (drive-truck driver5 s7 s0 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s0)
   goals met: 19 of 23
68. (disembark-truck driver5 s0 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s0) (empty truck2)
   goals met: 20 of 23
69. (drive-truck driver3 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 20 of 23
70. (drive-truck driver3 s5 s8 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s8)
   goals met: 20 of 23
71. (load-truck s8 package1 truck3)
   deleted: (at package1 s8)
   added: (in package1 truck3)
   goals met: 20 of 23
72. (drive-truck driver3 s8 s1 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   goals met: 20 of 23
73. (unload-truck s1 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s1)
   goals met: 21 of 23
74. (drive-truck driver3 s1 s7 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   goals met: 22 of 23
75. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   goals met: 22 of 23
76. (walk driver1 p2-0 s0)
   deleted: (at driver1 p2-0)
   added: (at driver1 s0)
   goals met: 22 of 23
77. (walk driver1 s0 p0-4)
   deleted: (at driver1 s0)
   added: (at driver1 p0-4)
   goals met: 22 of 23
78. (walk driver1 p0-4 s4)
   deleted: (at driver1 p0-4)
   added: (at driver1 s4)
   goals met: 22 of 23
79. (drive-truck driver3 s7 s4 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   goals met: 21 of 23
80. (disembark-truck driver3 s4 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s4) (empty truck3)
   goals met: 22 of 23
81. (board-truck driver1 s4 truck3)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 22 of 23
82. (drive-truck driver1 s4 s7 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   goals met: 23 of 23
